Repository: IrvinIrvin/TrashVanish
Catalog: TrashVanish/lang_*.resx
Languages: ru

# AppIsLoaded
source: Application is loaded
ru: Программа загружена

# caseSensetiveSetsWithCmplxRulesAreDone
source: Tasks with case sensetive sets with complex rules are done
ru: Задачи с наборами, чувствительными к регистру, с комплексными правилами завершены

# caseSensetiveTasksWithCmplxRulesAreDone
source: Tasks with case sensetive tasks with compelx rules are done
ru: Задачи, чувствительные к регистру, с комплексными правилами завершены

# complexRulesAreDone
source: Tasks with complex rules are done
ru: Задачи с комплексными правилами завершены

# complexSetsAreDone
source: Tasks with complex sets are done
ru: Задачи с наборами, с комплексными правилами, завершены

# extIsInvalid
source: Extension is invalid
ru: Расширение не корректно

# fileAlreadyExist
source: File "{0}" already exist in {1}, skipping...
ru: Файл "{0}" уже существует в {1}, пропускаю...

# noFilesForExt
source: There are no files for task "{0}", moving on to the next task
ru: Нет файлов для задачи "{0}", иду дальше

# noFilesForExtAndInclude
source: There are no files for the task "{0}" +" {1}", moving on to the next task
ru: Нет файлов для задачи "{0}" + "{1}", иду дальше

# notAllFilesWithExtWereMoved
source: Not all "{0}" files were copied successfully
ru: Не все файлы "{0}" были скопированы успешно

source: Path is invalid
ru: Путь не корректен

# relPathesAreForbidden
source: Relative pathes are forbidden
ru: Относительные пути запрещены

# ReqFieldsAreEmpty
source: Required fields are empty
ru: Обязательные поля не заполнены

# ruleCreatedSuccessfuly
source: Rule for {0} created successfuly
ru: Правило для {0} создано

# ruleForExtAlreadyExist
source: Rule for {0} already exists
ru: Правило для {0} уже существует

# rulesAreDone
source: Tasks with rules are done
ru: Задачи с правилами завершены

# ruleUpdatedSuccessfully
source: Rule for {0} updated successfully
ru: Правило для {0} обновлено

source: Set added successfully
ru: Набор успешно добавлен

# setsAreDone
source: Tasks with sets are done
ru: Задачи с наборами завершены

source: Start
ru: Старт

# taskCompletedWithIncludes
source: Task for"0" + "1" done successfully. Files copied: {2}
ru: Задача для "0" + "1" завершилось успешно. Перемещенно файлов: {2}

# tasksAreDoneForElapsedTime
source: All tasks done in {0} milliseconds
ru: Все задачи завершены за {0} миллисекунд

# unauthorizedAccessExceptionMessage
source: {0}. To copy file in {1} run app as administrator
ru: {0}. Чтобы скопировать файл в {1} запустите программу от имени администратра
